---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SkyBackgroundSettings
source: html/044733eb-a9c1-150d-cf8a-b9208a5f2452.htm
---
# SkyBackgroundSettings Members

Specifies whether the .NET object represents a valid Revit entity.